<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    //数据表 字段配置 导出表用
    '_table'       => [
        'behaviour'     => ['日期', '注册会员数', '活跃会员数', '独立会员数', '首页浏览量', '首页跳出率'],
        'order'         => ['日期', '下单时间', '商品ID', '商品名称', '用户ID', '商品单价', '成本价', '购买数量', '订单总额', '订单状态'],
        'visit'         => ['日期', '访问量', '平均会话', '页面链接'],
        'feature'       => [
            ['日期', '登录比例', '性别', '年龄'],
            ['登录用户比例', '未登录用户比例', '男性比例', '女性比例', '18以下比例', '18-24比例', '25-34比例', '35-44比例', '45-比例'],
        ],
        'area'          => ['日期', '江苏', '北京', '广东', '安徽', '四川', '浙江', '湖北', '吉林', '河南', '山东', '河北', '上海', '江西', '辽宁', '陕西', '福建'],
        'data'          => ['日期', 'UV', '登录用户数', '发帖数', 'PV'],
        'interest'      => ['日期', '影视音乐', '书籍阅读', '游戏', '个护美容', '体育健身', '教育培训', '家电数码', '资讯', '医疗健康', '软件应用', '网络购物', '花鸟萌宠', '餐饮美食', '休闲爱好', '休闲娱乐', '汽车', '求职创业'],
        'collect'       => ['日期', '访问用户', '客户端访问数', '主题数', '客户端主题数', '回复数', '客户端回复数', '签到数', '客户端签到数', '签到率', '新增会员数', '总会员数'],
        'step'          => [
            ['日期', '步长分布'],
            ['1', '2~5', '6~20', '21~50', '50+'],
        ],
        'ffrom'         => [
            ['日期', '贴吧', '安卓', 'IOS', '主动访问', '其他', 'PS', '阿拉丁', '外部PS', 'Tab页', 'pad', '导航站'],
            ['UV', '人均PV', '占比', 'UV', '人均PV', '占比', 'UV', '人均PV', '占比', 'UV', '人均PV', '占比', 'UV', '人均PV', '占比', 'UV', '人均PV', '占比', 'UV', '人均PV', '占比', 'UV', '人均PV', '占比', 'UV', '人均PV', '占比', 'UV', '人均PV', '占比', 'UV', '人均PV', '占比'],
        ],
        'iin'           => ['日期', '吧名称', '用户数', '吧名称', '用户数', '吧名称', '用户数', '吧名称', '用户数', '吧名称', '用户数'],
        'oout'          => ['日期', '吧名称', '用户数', '吧名称', '用户数', '吧名称', '用户数', '吧名称', '用户数', '吧名称', '用户数'],
        'ttime'         => ['日期', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
        'behaviourInfo' => [
            ['日期', '活跃', '人均PV', '人均发帖'],
            ['发主题者', '仅回复者', '围观者', '访问人数', '活跃度', '发主题者', '仅回复者', '围观者', '发主题者', '仅回复者', '围观者'],
        ],
        'click'         => ['日期', '点击量', '地址'],
        'tbActivity'    => ['日期', '活动名称', '主题贴id', '端类型', 'pv', 'uv', '登录用户数', '发回复贴数', '发回复贴人数', '发楼中楼数', '发楼中楼人数'],
        'baiduVisit'    => ['日期', '端类型', '吧名', 'pv', 'uv', '发帖总数', '总发帖人数', '发主题贴数', '发主题贴人数', '发回复贴数', '发回复贴人数', '当天关注吧次数', '签到次数'],
        'pool'          => ['日期', '剩余总数量', '获取总数量', '消耗总数量'],
        'synthesize'    => ['日期', '剩余总数量', '拥有人数', '过期数量'],
    ],
    '_upload_path' => __DIR__ . '/../excel/',
];
