<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    //各表 各字段的注释 用于每页注释显示
    '_info' => [
        'behaviour'       => ['注册会员数：注册会员的数量;（来自兑一兑）</br>活跃会员数：有访问网站行为的会员数量;（来自兑一兑）</br>独立访客：每一台独立电脑算一个独立访客;（来自兑一兑）</br>首页浏览量：网站内首页的访问数（来自GA）;</br>首页跳出率=浏览首页退出的次数/该页访问次数（来自GA）;</br>', '数据注释(部分来自兑一兑，部分来自GA)'],
        'order'           => ['商品ID：每个产品链接的后面都会自带一个ID编号;</br> 商品名：商品名称;</br> 用户ID：第一次注册时系统会自动分配一个唯一的一组号码;</br> 商品单价：一件商品的价格;</br> 购买数量：购买商品的数量;</br> 订单总额=商品单价*购买数量;</br> 成本价：商品购进的价格;</br> 订单状态：分为三种交易成功、交易失败、等待付款;</br>', '数据注释（全部来自兑一兑）'],
        'visit'           => ['访问量：对应链接访问量;</br>平均会话时长：在限定时间内，用户访问页面时的操作平均时长;</br>', '数据注释（全部来自GA）'],
        'feature'         => ['登录比例： 用户登录情况分布</br>年龄占比：用户年龄分布</br>性别：用户性别分布', '数据注释（全部来自百度）'],
        'area'            => ['用户访问地域分布排名。用户带电脑出差跨省市，则所跨省市的访问用户数均+1。', '数据注释（全部来自百度）'],
        'interest'        => ['用户兴趣占比', '数据注释（全部来自百度）'],
        'data'            => ['UV：蓝钻吧当日的独立访问用户数;</br>
                                登陆用户数：当日访问用户中登陆贴吧的用户数;</br>
                                发帖数：当日蓝钻吧总发帖数量（包括发主题帖、发回复贴、发楼中楼）;</br>
                                PV：蓝钻吧当日的点击量;</br>
                                ', '数据注释'],
        'collect'         => ['访问用户：访问蓝钻吧的所有用户;</br>客户端访问用户数：访问蓝钻吧的用户;</br>主题数：蓝钻吧发布主题帖的数量;</br>客户端主题数：蓝钻吧客户端发布主题帖的数量;</br>回复数：蓝钻吧发布回复的数量;</br>客户端回复数：蓝钻吧客户端发布回复的数量;</br>签到数：蓝钻吧签到人数;</br>客户端签到数：蓝钻吧客户端签到人数;</br>签到率=签到人数/活跃用户;</br>新增会员数：新关注蓝钻吧用户数;</br>总会员数：关注蓝钻吧用户总数;</br>', '数据注释（全部来自百度）'],
        'step'            => ['用户在贴吧域内访问页面数;', '数据注释（全部来自百度）'],
        'ffrom'           => ['独立访客：每一台独立电脑算一个独立访客;</br>人均页面浏览量=网站内首页的访问数/独立访客;</br>占比=访问来源独立访客/总独立访客;</br>', '数据注释（全部来自百度）'],
        'iin'             => ['用户流入：用户从其他吧流入蓝钻吧</br>吧名称：用户来源吧的吧名称</br>用户数：UV', '数据注释（全部来自百度）'],
        'oout'            => ['用户流出：用户从蓝钻吧流入到其他吧</br>吧名称：用户去往吧的吧名称</br>用户数：UV', '数据注释（全部来自百度）'],
        'ttime'           => ['', '数据注释（全部来自百度）'],
        'behaviourInfo'   => ['发主题者：蓝钻吧发主题者人数;</br>仅回复者：蓝钻吧仅回复者人数;</br>围观者者：蓝钻吧围观者者人数;</br>访问人数：访问蓝钻吧人数总和;</br>人均PV=访问数/蓝钻吧总访问数;</br>人均发帖=总发帖数/发帖人数;</br>', '数据注释（全部来自百度）'],
        'click'           => ['显示数据点击总量：检索后所有数据点击量之和', '数据注释（全部来自GA）'],
        'tbActivity'      => ['活动名称：对应主题帖的活动名称;</br>
                                主题ID：该活动帖的帖子ID;</br>
                                端类型：该端类型下的数据;</br>
                                PV：该吧在该端当日下的点击量;</br>
                                UV：该吧在该端当日的独立用户量;</br>
                                登陆用户数：登陆百度贴吧域下的用户数量;</br>
                                发回复帖数：该吧在该端当日发回复帖总数;</br>
                                发回复人数：该吧在该端当日发回复帖总人数;</br>
                                发楼中楼数：该吧在该端当日发楼中楼总数;</br>
                                发楼中楼人数：该吧在该端当日发楼中楼总人数;</br>
                                ', '数据注释（全部来自百度）'],
        'baiduVisit'      => ['PV：该吧在该端当日下的点击量</br>UV：该吧在该端当日的独立用户量</br>发帖总数：该吧在该端当日发帖总数（包括发主题和发回复）</br>总发帖人数：该吧在该端当日发帖的总人数</br>发主题帖数：该吧在该端当日发主题帖总数</br>发主题帖人数：该吧在该端当日发主题帖总人数</br>发回复帖数：该吧在该端当日发回复帖总数</br>发回复人数：该吧在该端当日发回复帖总人数</br>当天关注吧次数：该吧在该端当日被关注总次数</br>签到次数：该吧在该端当日签到次数', '数据注释（全部来自百度）'],
        'synthesize'      => ['蓝钻综合数据：所有蓝钻场景的综合数据;</br>  剩余总数量：所有场景当日剩余的蓝钻总数量;</br>拥有人数：所有场景持有蓝钻的总人数;</br>  过期数量：所有场景当日过期的蓝钻总数量;</br>', '数据注释（全部来自百度）'],
        'testScene'       => ['剩余总数量：该场景下当日剩余的蓝钻总数量;</br>获取总数量：test场景无获取渠道;</br>  消耗总数量：test场景当日发放的蓝钻总数量;</br>', '数据注释（全部来自百度）'],
        'cost'            => ['剩余总数量：该场景下当日剩余的蓝钻总数量;</br>获取总数量：提现场景当日兑换的蓝钻总数量;</br>  消耗总数量：提现场景无消耗渠道;</br>', '数据注释（全部来自百度）'],
        'trading'         => ['剩余总数量：该场景下当日剩余的蓝钻总数量;</br>获取总数量：交易场景当日出售蓝钻的总数量（出售指用户行为）;</br>  消耗总数量：交易场景当日购买蓝钻的总数量（购买指用户行为）;</br>', '数据注释（全部来自百度）'],
        'ALA'             => ['剩余总数量：该场景下当日剩余的蓝钻总数量;</br>获取总数量：ALA蓝钻场景无获取渠道;</br>  消耗总数量：ALA蓝钻场景当日发放的蓝钻总数量;</br>', '数据注释（全部来自百度）'],
        'SGCDistribution' => ['剩余总数量：该场景下当日剩余的蓝钻总数量;</br>获取总数量：发行场景当日获取蓝钻的总数量;</br>  消耗总数量：发行场景当日发行的蓝钻总数量量;</br>', '数据注释（全部来自百度）'],
        'ASGGame'         => ['剩余总数量：该场景下当日剩余的蓝钻总数量;</br>获取总数量：该场景当日获取蓝钻的总数量;</br>  消耗总数量：该场景当日发行的蓝钻总数量;</br>', '数据注释（全部来自百度）'],
        'expired'         => ['剩余总数量：该场景下当日剩余的蓝钻总数量;</br>获取总数量：过期场景当日过期蓝钻总数量;</br>  消耗总数量：过期场景无消耗渠道;</br>', '数据注释（全部来自百度）'],
        'operation'       => ['剩余总数量：该场景下当日剩余的蓝钻总数量;</br>获取总数量：ALA蓝钻运营需求场景无获取渠道;</br>  消耗总数量：ALA蓝钻运营需求场景当日发放的蓝钻总数量;</br>', '数据注释（全部来自百度）'],
    ],
];
